# Последовательностью Фибоначчи называется
# последовательность чисел a0
# , a1
# , ..., an
# , ..., где
# a0
#  = 0, a1
#  = 1, ak
#  = ak-1 + ak-2 (k > 1).
# Требуется найти N-е число Фибоначчи
# Input: 7
# Output: 21

# k = input()
# a0 = 0
# a1 = 1
# ak = ak-1 + ak-2 (k > 1)


# def fib(n):
#     if n in [a0, ak]:
#         return fib(n)
#         return fib(n - 1) + fib(n - 2)


# Задача №35. Решение в группах
# Напишите функцию, которая принимает одно число и
# проверяет, является ли оно простым
# Напоминание: Простое число - это число, которое
# имеет 2 делителя: 1 и n(само число)
# Input: 5
# Output: yes

# n = int(input())


# def simple(n, d=2):
#     if n * n == 1 <= 1:
#         return ('yes')
#     elif n % d == 0:
#         return ('no')


# print(simple(n))


# Задача №37. Общее обсуждение
# 5 минут
# Дано натуральное число N и
# последовательность из N элементов.
# Требуется вывести эту последовательность в
# обратном порядке.
# Примечание. В программе запрещается
# объявлять массивы и использовать циклы
# (даже для ввода и вывода).
# Input: 2 -> 3 4
# Output: 4 3


# n = input()
# m = 0
# def count_back(n):
#     for i in range(n):
#         i +=1
#         m =


# Верных решений нет!!
